app/views/users/edit.html.erb

  <%= u.label "Change your company"%>
  <%= u.collection_select :company_id, Company.all, :id, :name %>
---
SELECT "companies".* FROM "companies"