app/views/users/new.html.erb

  <%= u.label "Please select your company"%>
  <%= u.collection_select :company_id, Company.all, :id, :name %>
---
SELECT "companies".* FROM "companies"