app/views/customers/show.html.erb

SELECT "rentals".* FROM "rentals" WHERE "rentals"."customer_id" = ?  [["customer_id", 1]]
---
<ul>
<% @customer.rentals.each do |x|%>

SELECT "rentals".* FROM "rentals" WHERE "rentals"."customer_id" = ?  [["customer_id", 1]]
---
<ul>
<% @customer.rentals.each do |x|%>