app/helpers/companies_helper.rb

    def current_company
        Company.find(current_user.company_id)
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]