app/helpers/rentals_helper.rb

SELECT  "rentals".* FROM "rentals" WHERE "rentals"."equipment_id" = ? AND "rentals"."rental_in" IS NULL LIMIT ?  [["equipment_id", 1], ["LIMIT", 1]]
---
    def rental_check_in_link(equipment)
        @rental = equipment.rentals.find_by(rental_in: nil)