app/controllers/companies_controller.rb

      def create
        @company = Company.new(company_params)
        @company.save
---
INSERT INTO "companies" ("name", "address", "phone_number", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "United Rentals - Denver"], ["address", "1231 Rental Way"], ["phone_number", "234 234 1231"], ["created_at", "2019-09-15 01:05:10.258220"], ["updated_at", "2019-09-15 01:05:10.258220"]]