app/controllers/customers_controller.rb

INSERT INTO "customers" ("name", "phone_number", "address", "company_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
    def create
        @customer = Customer.new(customer_params)
        @customer.save

SELECT  "customers".* FROM "customers" WHERE "customers"."company_id" = ? LIMIT ?  [["company_id", 1], ["LIMIT", 1]]
---
    def index
        @customers = Customer.where(company_id: current_user.company_id)

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @customer = Customer.find_by_id(params[:id])