app/controllers/equipment_controller.rb

SELECT  "equipment".* FROM "equipment" WHERE "equipment"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      def set_equipment
        @equipment = Equipment.find_by(id: params[:id])