app/controllers/equipment_controller.rb

INSERT INTO "equipment" ("name", "make", "machine_type", "rental_rate_day", "company_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
      def create
        @equipment = Equipment.new(equipment_params)
        @equipment.save

SELECT "equipment".* FROM "equipment" WHERE (name like '%excavator%')
---
      def index
        @equipment = Equipment.all

SELECT  "equipment".* FROM "equipment" WHERE "equipment"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      def show
        @equipment = Equipment.find_by_id(params[:id])

SELECT  "equipment".* FROM "equipment" WHERE "equipment"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      def edit
        @equipment = Equipment.find_by_id(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "equipment" SET "name" = ?, "updated_at" = ? WHERE "equipment"."id" = ?  [["name", "JD Skid Steer"], ["updated_at", "2019-09-15 17:23:07.444310"], ["id", 1]]
---
       def update
        @equipment = User.find_by(id: params[:id])
        @equipment.update(equipment_params)