app/controllers/rentals_controller.rb

    def index
        @customer = Customer.find(params[:customer_id])
        @rentals = @customer.rentals.where(rental_in: nil)
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "rentals".* FROM "rentals" WHERE "rentals"."customer_id" = ? HAVING "rentals"."rental_in" = ?  [["customer_id", 1], ["rental_in", "nil"]]

   def edit
    @rental = Rental.find_by_id(params[:id])
---
SELECT  "rentals".* FROM "rentals" WHERE "rentals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

   def update
    @rental = Rental.find_by(id: params[:id])
    if rental_params[:check_in] == "true"
        @rental.check_in
        @rental.save
---
SELECT  "rentals".* FROM "rentals" WHERE "rentals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "rentals" SET "rental_in" = ?, "updated_at" = ? WHERE "rentals"."id" = ?  [["rental_in", "2019-09-15 13:43:39 -0600"], ["updated_at", "2019-09-15 19:43:39.485952"], ["id", 1]]

    def rented
        @eq = Equipment.where(rented: true)
---
SELECT "equipment".* FROM "equipment" WHERE "equipment"."rented" = ?  [["rented", 1]]