app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "david@david.com"], ["LIMIT", 1]]
---
       def create
         @user = User.find_by(email: params[:user][:email])

SELECT  "users".* FROM "users" WHERE "users"."uid" = ? LIMIT ?  [["uid", "45477783"], ["LIMIT", 1]]
INSERT INTO "users" ("name", "password_digest", "uid", "created_at", "updated_at", "company_id") VALUES (?, ?, ?, ?, ?, ?)
---
       def gitcreate

        @user = User.find_by(uid: auth['uid'])
        if @user
          session[:user_id] = @user.id
          redirect_to @user
        else
         @user = User.new(uid: auth['uid'], name: auth['info']['name'], email: auth['info']['email'], password: auth['uid'])
         @user.company_id = "1"
         @user.save