app/controllers/users_controller.rb

SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "users" ("name", "password_digest", "email", "phone_number", "created_at", "updated_at", "company_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
        @user = User.new(user_params)
        @company = Company.find_by_id(user_params[:company_id])
        @user.company = @company
        @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "phone_number" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["phone_number", "242 234 2342"], ["email", "davidstewart@gmail.com"], ["updated_at", "2019-09-16 01:44:37.970515"], ["id", 1]]
UPDATE "users" SET "name" = ?, "phone_number" = ?, "email" = ?, "company_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "David Stewart"], ["phone_number", ""], ["email", ""], ["company_id", 2], ["updated_at", "2019-09-16 03:13:20.841591"], ["id", 2]]
---
    def update
    @user = User.find_by(id: params[:id])
    @user.update(user_params)
    if @user.save