app/models/rental.rb

SELECT  "equipment".* FROM "equipment" WHERE "equipment"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
UPDATE "equipment" SET "rented" = ?, "updated_at" = ? WHERE "equipment"."id" = ?  [["rented", 1], ["updated_at", "2019-09-15 18:46:19.620000"], ["id", 1]]
INSERT INTO "rentals" ("customer_id", "equipment_id", "rental_duration", "project_name", "rental_out", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def check_out
        self.rental_out = Time.now
        @equipment = Equipment.find(self.equipment_id)
        @equipment.rented = true
        @equipment.save
        self.save

SELECT  "equipment".* FROM "equipment" WHERE "equipment"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "equipment" SET "rented" = ?, "updated_at" = ? WHERE "equipment"."id" = ?  [["rented", 0], ["updated_at", "2019-09-15 19:43:39.462037"], ["id", 1]]
UPDATE "rentals" SET "rental_in" = ?, "updated_at" = ? WHERE "rentals"."id" = ?  [["rental_in", "2019-09-15 13:43:39 -0600"], ["updated_at", "2019-09-15 19:43:39.485952"], ["id", 1]]
---
    def check_in
        self.rental_in = Time.now
        @equipment = Equipment.find(self.equipment_id)
        @equipment.rented = false
        @equipment.save
        self.save